<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run() 
    {
        $data = [
            'لوحة التحكم',
            'قائمة العملاء',
            'انشاء عميل',
            'تعديل عميل',
            'حذف عميل',
            'تغيير كلمة مرور عميل',
            'قائمة القضايا',
            'مشاهدة قضية',
            'انشاء قضية',
            'تعديل قضية',
            'حذف قضية',
            'قائمة القضايا الجديدة',
            'قائمة القضايا الجارية',
            'قائمة القضايا المنتهية',
            'اضافة لسير القضية',
            'تعديل لسير القضية',
            'حذف لسير القضية',
            'تحميل المرفق',
            'حذف المرفق',
            'قائمة الايرادات',
            'انشاء ايراد',
            'تعديل ايراد',
            'حذف ايراد',
            'قائمة المصروفات',
            'انشاء مصروف',
            'تعديل مصروف',
            'حذف مصروف',
            'قائمة الموظفين',
            'انشاء موظف',
            'تعديل موظف',
            'حذف موظف',
            'تغيير كلمة مرور موظف',
            'قائمة الادوار',
            'انشاء دور',
            'تعديل دور',
            'حذف دور',
            'قائمة الفروع',
            'انشاء فرع',
            'تعديل فرع',
            'حذف فرع',
            'الاعدادات',
            'تغيير حالة القضية',
            'التفاصيل المالية للقضية',
            'قائمة انواع القضايا',
            'انشاء نوع قضية',
            'تعديل نوع القضية',
            'حذف نوع القضية',
            'قائمة المحاكم',
            'انشاء محكمة جديدة',
            'تعديل محكمة',
            'حذف محكمة',
            'قائمة الدوائر القضائية',
            'انشاء دائرة قضائية',
            'تعديل دائرة قضائية',
            'حذف دائرة قضائية',
            'مشاهدة نشاط الموظف',
            'قائمة قضايا العمليات',
            'قائمة قضايا التحصيل',
        ];

        foreach ($data as $permission) {
             Permission::create(['name' => $permission]);
        }
    }
}